In [1]:
import pandas as pd

In [2]:
ser1= pd.Series([1,2,3,4,5,6,7])

In [3]:
ser2= pd.Series([5,6,7,8,9,10,11])

In [4]:
result = ser1[~ser1.isin(ser2)]

In [5]:
print(result)

0    1
1    2
2    3
3    4
dtype: int64

In [6]:
ser3 = pd.Series([1,1,2,3,4,5,6,4,5,3,6,4,2,3,4,2,7,8,9,3,4,6,6,7,4,6,2,4,4,2,5,3,6,4,2,3,1,2,3,5,3,2,4,2,3,4])

In [7]:
ser3.value_counts()

4    11
3     9
2     9
6     6
5     4
1     3
7     2
9     1
8     1
dtype: int64

In [8]:
ser3[~ser3.isin(ser3.value_counts().index[:3])] = "less frequent"

In [9]:
print(ser3)

0     less frequent
1     less frequent
2                 2
3                 3
4                 4
5     less frequent
6     less frequent
7                 4
8     less frequent
9                 3
10    less frequent
11                4
12                2
13                3
14                4
15                2
16    less frequent
17    less frequent
18    less frequent
19                3
20                4
21    less frequent
22    less frequent
23    less frequent
24                4
25    less frequent
26                2
27                4
28                4
29                2
30    less frequent
31                3
32    less frequent
33                4
34                2
35                3
36    less frequent
37                2
38                3
39    less frequent
40                3
41                2
42                4
43                2
44                3
45                4
dtype: object

In [10]:
ser4 = pd.Series([1,2,3,4,5,6])
ser5=pd.Series([7,8,9,10,11,12])

In [12]:
#horizontal stacking
df_hor = pd.concat([ser4, ser5], axis = 1)
df_hor

   0   1
0  1   7
1  2   8
2  3   9
3  4  10
4  5  11
5  6  12

In [14]:
#vertical stacking
df_ver = pd.concat([ser1, ser2], axis = 0)
df_ver

0     1
1     2
2     3
3     4
4     5
5     6
6     7
0     5
1     6
2     7
3     8
4     9
5    10
6    11
dtype: int64

In [27]:
serA= pd.Series([1,1,2,2,4],dtype=float)
serB = pd.Series([0.6,1.29,1.99,2.69,3.4],dtype=float)

In [28]:
print(serA,serB)

0    1.0
1    1.0
2    2.0
3    2.0
4    4.0
dtype: float64 0    0.60
1    1.29
2    1.99
3    2.69
4    3.40
dtype: float64

In [29]:
#MSE
import numpy as np
np.sum(np.square(serA-serB))/5

0.21606

In [51]:
#lower case to upper

serC = pd.Series(['apple','banana','cat','dog'])

In [39]:
serC.str.capitalize()

0     Apple
1    Banana
2       Cat
3       Dog
dtype: object

In [62]:
for index,item in serC.iteritems():
  print(serC[index][::-1].capitalize()[::-1])

applE
bananA
caT
doG

In [63]:
import pandas as pd

In [68]:
df = pd.read_csv("https://raw.githubusercontent.com/selva86/datasets/master/BostonHousing.csv")

In [69]:
df.head()

      crim    zn  indus  chas    nox  ...  tax  ptratio       b  lstat  medv
0  0.00632  18.0   2.31     0  0.538  ...  296     15.3  396.90   4.98  24.0
1  0.02731   0.0   7.07     0  0.469  ...  242     17.8  396.90   9.14  21.6
2  0.02729   0.0   7.07     0  0.469  ...  242     17.8  392.83   4.03  34.7
3  0.03237   0.0   2.18     0  0.458  ...  222     18.7  394.63   2.94  33.4
4  0.06905   0.0   2.18     0  0.458  ...  222     18.7  396.90   5.33  36.2

[5 rows x 14 columns]

In [ ]:
#first three columns

In [70]:
df = pd.read_csv("https://raw.githubusercontent.com/selva86/datasets/master/BostonHousing.csv",usecols=[0,1,2])

In [71]:
df.head()

      crim    zn  indus
0  0.00632  18.0   2.31
1  0.02731   0.0   7.07
2  0.02729   0.0   7.07
3  0.03237   0.0   2.18
4  0.06905   0.0   2.18

In [75]:
df = pd.read_csv("https://raw.githubusercontent.com/selva86/datasets/master/BostonHousing.csv")

In [76]:
df1 = df.iloc[:,-3:]

In [77]:
df1.head()

        b  lstat  medv
0  396.90   4.98  24.0
1  396.90   9.14  21.6
2  392.83   4.03  34.7
3  394.63   2.94  33.4
4  396.90   5.33  36.2

In [78]:
df = pd.read_csv("https://raw.githubusercontent.com/selva86/datasets/master/BostonHousing.csv",usecols=["age","dis","rad"])

In [79]:
df.head()

    age     dis  rad
0  65.2  4.0900    1
1  78.9  4.9671    2
2  61.1  4.9671    2
3  45.8  6.0622    3
4  54.2  6.0622    3

In [82]:
df1=df[["age","dis","rad"]]

In [83]:
df1.head()

    age     dis  rad
0  65.2  4.0900    1
1  78.9  4.9671    2
2  61.1  4.9671    2
3  45.8  6.0622    3
4  54.2  6.0622    3

In [87]:
#exclude 5th row
df[~df.index.isin([4])]

      age     dis  rad
0    65.2  4.0900    1
1    78.9  4.9671    2
2    61.1  4.9671    2
3    45.8  6.0622    3
5    58.7  6.0622    3
..    ...     ...  ...
501  69.1  2.4786    1
502  76.7  2.2875    1
503  91.0  2.1675    1
504  89.3  2.3889    1
505  80.8  2.5050    1

[505 rows x 3 columns]

In [88]:
df.head(7)

    age     dis  rad
0  65.2  4.0900    1
1  78.9  4.9671    2
2  61.1  4.9671    2
3  45.8  6.0622    3
4  54.2  6.0622    3
5  58.7  6.0622    3
6  66.6  5.5605    5

In [89]:
#7
data = pd.read_csv("https://raw.githubusercontent.com/selva86/datasets/master/BostonHousing.csv")

In [90]:
data.head()

      crim    zn  indus  chas    nox  ...  tax  ptratio       b  lstat  medv
0  0.00632  18.0   2.31     0  0.538  ...  296     15.3  396.90   4.98  24.0
1  0.02731   0.0   7.07     0  0.469  ...  242     17.8  396.90   9.14  21.6
2  0.02729   0.0   7.07     0  0.469  ...  242     17.8  392.83   4.03  34.7
3  0.03237   0.0   2.18     0  0.458  ...  222     18.7  394.63   2.94  33.4
4  0.06905   0.0   2.18     0  0.458  ...  222     18.7  396.90   5.33  36.2

[5 rows x 14 columns]

In [94]:
cols=list(data.columns)

In [95]:
cols

['crim',
 'zn',
 'indus',
 'chas',
 'nox',
 'rm',
 'age',
 'dis',
 'rad',
 'tax',
 'ptratio',
 'b',
 'lstat',
 'medv']

In [98]:
new_cols=['a','b','c','d','e','f','g','h','i','j','k','l','m','n']

In [100]:
data.rename(columns=dict(zip(cols, new_cols)), inplace=True)

In [101]:
data.columns

Index(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j', 'k', 'l', 'm', 'n'], dtype='object')

In [103]:
data.head()

         a     b     c  d      e      f  ...  i    j     k       l     m     n
0  0.00632  18.0  2.31  0  0.538  6.575  ...  1  296  15.3  396.90  4.98  24.0
1  0.02731   0.0  7.07  0  0.469  6.421  ...  2  242  17.8  396.90  9.14  21.6
2  0.02729   0.0  7.07  0  0.469  7.185  ...  2  242  17.8  392.83  4.03  34.7
3  0.03237   0.0  2.18  0  0.458  6.998  ...  3  222  18.7  394.63  2.94  33.4
4  0.06905   0.0  2.18  0  0.458  7.147  ...  3  222  18.7  396.90  5.33  36.2

[5 rows x 14 columns]

In [106]:
data.drop(['a','b'], axis = 1, inplace = True)

In [107]:
data.head()

      c  d      e      f     g       h  i    j     k       l     m     n
0  2.31  0  0.538  6.575  65.2  4.0900  1  296  15.3  396.90  4.98  24.0
1  7.07  0  0.469  6.421  78.9  4.9671  2  242  17.8  396.90  9.14  21.6
2  7.07  0  0.469  7.185  61.1  4.9671  2  242  17.8  392.83  4.03  34.7
3  2.18  0  0.458  6.998  45.8  6.0622  3  222  18.7  394.63  2.94  33.4
4  2.18  0  0.458  7.147  54.2  6.0622  3  222  18.7  396.90  5.33  36.2

In [112]:
data.drop(df.index[[10,11]],inplace=True)

In [114]:
data.shape

(504, 12)

In [115]:
data.to_csv("boston_new.csv")

In [116]:
#diabetes

In [132]:
data=pd.read_csv("https://raw.githubusercontent.com/plotly/datasets/master/diabetes.csv")

In [133]:
data.head()

   Pregnancies  Glucose  BloodPressure  ...  DiabetesPedigreeFunction  Age  Outcome
0            6      148             72  ...                     0.627   50        1
1            1       85             66  ...                     0.351   31        0
2            8      183             64  ...                     0.672   32        1
3            1       89             66  ...                     0.167   21        0
4            0      137             40  ...                     2.288   33        1

[5 rows x 9 columns]

In [130]:
# data=data[data.columns[data.columns!='Outcome']]

In [134]:
# data.head()

In [136]:
cols=[data.columns[data.columns!='Outcome']]

In [142]:
for col in cols:
  data= data[col].replace(0,np.nan)
  mean=data[col].mean()
  data=data[col].replace(np.nan,mean)

In [146]:
data.isnull().sum()

Pregnancies                 0
Glucose                     0
BloodPressure               0
SkinThickness               0
Insulin                     0
BMI                         0
DiabetesPedigreeFunction    0
Age                         0
dtype: int64